# =======================Завдання 1/Task_1 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++
# Використовуючи приведення типів і input, розв'яжіть задачу для розрахунку площі.
# Ширина та висота задані за допомогою функції input. 
# Необхідно, як і раніше, розрахувати площу, але потрібно рядковий тип перетворити на чисельний (float) 
# при отриманні значення через input. Змінну show створювати не треба.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

length = float(input("Введіть довжину прямоктника в метрах  "))
width = float(input("Введіть широну прямоктника в метрах "))
area = length*width
print(f"Площа заданого прямокутника = {area} м ")