# =======================Завдання 1/Task_1 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++
# Використовуючи приведення типів і input, розв'яжіть задачу для розрахунку площі.
# Ширина та висота задані за допомогою функції input. 
# Необхідно, як і раніше, розрахувати площу, але потрібно рядковий тип перетворити на чисельний (float) 
# при отриманні значення через input. Змінну show створювати не треба.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# length = float(input("Введіть довжину прямоктника в метрах  "))
# width = float(input("Введіть широну прямоктника в метрах "))
# area = length*width
# print(f"Площа заданого прямокутника = {area} м ")

# =======================Завдання 2/Task_2 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Нехай нам необхідно розрахувати послуги споживання електрики.
# У змінній rate у нас знаходиться тариф за електроенергію 1.68,
# а в змінній value — значення показання лічильника, задайте для неї розумне ціле число в кіловатах.
# Розрахуйте та помістіть у змінну payment рахунок за електрику.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# rate = 1.68
# value = 150
# payment =rate*value
# print(f'Вартість електроенергії : {payment} грн')

# =======================Завдання 3/Task_3 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Повернемося до попереднього завдання. У змінній rate у нас знаходиться тариф за електроенергію — 1.68.
# Але тепер нам потрібно вести розрахунок денного та нічного тарифу. 
# Нічний тариф розраховується як половина денного, тобто. rate треба поділити на 2.
# У змінній value_day — денні показання лічильника, а в змінній value_night — нічні. Знову ж таки, 
# задайте для них розумне ціле число кіловат. 
# Розрахуйте та помістіть у змінну payment рахунок за електрику, але вже з урахуванням денного та нічного тарифів.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# rate = 1.68
# value_day =150
# value_night =20
# payment =(value_day+value_night/2)*rate
# print(f"Вартість електроенергії : {payment} грн")

# =======================Завдання 4/Task_4 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Знову повернемося до попереднього завдання. Додамо перед обчисленням змінної payment пояснювальний коментар. 
# Закоментуйте текст 'Payment for electricity for the current month', щоб код став робочим.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# rate = 1.68
# value_day = 358
# value_night = 103
# #Payment for electricity for the current month
# payment = rate * value_day + rate / 2 * value_night #Payment for electricity for the current month
# print(f"Вартість електроенергії : {payment} грн ")