# =======================Завдання 1/Task_1 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++
# Використовуючи приведення типів і input, розв'яжіть задачу для розрахунку площі.
# Ширина та висота задані за допомогою функції input. 
# Необхідно, як і раніше, розрахувати площу, але потрібно рядковий тип перетворити на чисельний (float) 
# при отриманні значення через input. Змінну show створювати не треба.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# length = float(input("Введіть довжину прямоктника в метрах  "))
# width = float(input("Введіть широну прямоктника в метрах "))
# area = length*width
# print(f"Площа заданого прямокутника = {area} м ")

# =======================Завдання 2/Task_2 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Нехай нам необхідно розрахувати послуги споживання електрики.
# У змінній rate у нас знаходиться тариф за електроенергію 1.68,
# а в змінній value — значення показання лічильника, задайте для неї розумне ціле число в кіловатах.
# Розрахуйте та помістіть у змінну payment рахунок за електрику.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# rate = 1.68
# value = 150
# payment =rate*value
# print(f'Вартість електроенергії : {payment} грн')
