# =======================Завдання 1/Task_1 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++
# Використовуючи приведення типів і input, розв'яжіть задачу для розрахунку площі.
# Ширина та висота задані за допомогою функції input. 
# Необхідно, як і раніше, розрахувати площу, але потрібно рядковий тип перетворити на чисельний (float) 
# при отриманні значення через input. Змінну show створювати не треба.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# length = float(input("Введіть довжину прямоктника в метрах  "))
# width = float(input("Введіть широну прямоктника в метрах "))
# area = length*width
# print(f"Площа заданого прямокутника = {area} м ")

# =======================Завдання 2/Task_2 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Нехай нам необхідно розрахувати послуги споживання електрики.
# У змінній rate у нас знаходиться тариф за електроенергію 1.68,
# а в змінній value — значення показання лічильника, задайте для неї розумне ціле число в кіловатах.
# Розрахуйте та помістіть у змінну payment рахунок за електрику.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# rate = 1.68
# value = 150
# payment =rate*value
# print(f'Вартість електроенергії : {payment} грн')

# =======================Завдання 3/Task_3 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Повернемося до попереднього завдання. У змінній rate у нас знаходиться тариф за електроенергію — 1.68.
# Але тепер нам потрібно вести розрахунок денного та нічного тарифу. 
# Нічний тариф розраховується як половина денного, тобто. rate треба поділити на 2.
# У змінній value_day — денні показання лічильника, а в змінній value_night — нічні. Знову ж таки, 
# задайте для них розумне ціле число кіловат. 
# Розрахуйте та помістіть у змінну payment рахунок за електрику, але вже з урахуванням денного та нічного тарифів.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# rate = 1.68
# value_day =150
# value_night =20
# payment =(value_day+value_night/2)*rate
# print(f"Вартість електроенергії : {payment} грн")

# =======================Завдання 4/Task_4 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Знову повернемося до попереднього завдання. Додамо перед обчисленням змінної payment пояснювальний коментар. 
# Закоментуйте текст 'Payment for electricity for the current month', щоб код став робочим.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# rate = 1.68
# value_day = 358
# value_night = 103
# #Payment for electricity for the current month
# payment = rate * value_day + rate / 2 * value_night #Payment for electricity for the current month
# print(f"Вартість електроенергії : {payment} грн ")

# =======================Завдання 5/Task_5 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# При покупці квитків нам завжди необхідно знати ім'я та прізвище покупця. 
# Оголосимо дві рядкові змінні: first_name, яка містить ім'я, та змінну last_name, 
# в яку помістимо прізвище користувача. Створіть ці дві змінні та привласніть їм своє ім'я та прізвище.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# first_name = "Andrew"
# last_name = "Go_It"
# print(f'{first_name} {last_name}')

# =======================Завдання 6/Task_6 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# В попередньому завданні ми створили дві змінні first_name, яка містить ім'я, та last_name,
# в яку помістили прізвище. 
# Давайте зробимо конкатенацію цих двох змінних через символ пробілу і помістимо результат у змінну full_name.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# first_name = "Andrew"
# last_name = "Go_It"
# full_name = first_name + " " + last_name
# print(f"{full_name}")

# =======================Завдання 7/Task_7 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# На цю мить у нас є три змінні: first_name, last_name та full_name
# Додамо змінну message, яка фактично буде прототипом шаблонного листа користувачеві, 
# який купив квиток. Цю змінну ми сформуємо за допомогою f-рядка. 
# У змінну message ми, за допомогою f-рядка, помістимо рядок наступного змісту:

# "Dear <підставляємо first_name>, we inform you that you have purchased a ticket 
# to travel to the island of Mauritius. Departure June 31 of this year. 
# Have a passport at <підставляємо full_name>. We are looking forward to seeing you!"

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# first_name = "John"
# last_name = "Smith"
# full_name = first_name + " " + last_name
# message = f"\nDear {first_name}, we inform you that you have purchased a ticket to travel to the island of Mauritius. \nDeparture June 31 of this year. Have a passport at {full_name}. We are looking forward to seeing you!\n"
# print(message)

# =======================Завдання 8/Task_8 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Змінна length містить довжину, а змінна width — ширину кімнати. 
# Необхідно зробити розрахунок площі кімнати та результат помістити в змінну area.
# Додайте змінну show, в яку помістіть рядок з наступним шаблоном:
# 'With width <значення ширини> and length <значення довжини> of the room, its area is equal to <значення площі>'.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# length = 2.75
# width = 1.75
# area =length*width
# show = f"With width {width}\nand length {length} of the room,\nits area is equal to {area}"
# print(show)

# =======================Завдання 9/Task_9 ==================
#++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Необхідно виконати додавання двох комплексних чисел 
# (нагадаємо, що комплексні числа підтримують не всі математичні операції та не всі операції порівняння).

# Перша змінна a дорівнює -2 + 3j і друга змінна b дорівнює 4 + 2.1j. 
# Результат необхідно помістити у змінну result.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# a =-2+3j
# b =4+2.1j
# result =a+b
# print({result})

# =======================Завдання 10/Task_10 ==================
#++++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Необхідно обчислити корені квадратного рівняння.
# a · x2 + b · x + c = 0
# Задайте змінні коефіцієнти a, b, c зі значеннями -2, 7, -6 відповідно
# Дискримінант рівняння помістіть у змінну D
# D = b2 - 4 · a · c
# Корені рівняння помістіть у змінні x1 та x2, відповідно.
# x1 = (-b + D0.5) / (2 · a)
# x2 = (-b - D0.5) / (2 · a)

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# import math

# a = -2
# b = 7
# c = -6
# D =b**2 - 4 * a * c
# x1 =(-b + D**0.5) / (2 * a)
# x2 =(-b - D**0.5) / (2 * a)
# print(f"x1= {x1},\nx2= {x2}")


# =======================Завдання 11/Task_11 ==================
#++++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Булевий тип часто використовують, щоб позначити стан об'єкта.
# Наприклад, змінна is_active може вказувати, чи активний обліковий запис користувача чи ні. 
# Також акаунти користувачів часто не видаляють із бази даних, а просто встановлюють їм властивість is_delete –
# це називають soft delete (м'яке видалення). 
# Тож встановіть змінній is_active істинне значення, а змінній is_delete — хибне.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# is_active =True
# is_delete =False
# print(f"{is_active}\n{is_delete} ")

# =======================Завдання 12/Task_12 ==================
#++++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Заведіть чотири змінні різного типу та надайте їм значення відповідного типу.

# name — рядкова змінна
# age — числова змінна
# is_active — булева змінна
# subscription — встановити значення None

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++

# name = "Hello"
# age = 15
# is_active = True
# subscription = None
# print(f"{name}\n{age}\n{is_active}\n{subscription}")

# =======================Завдання 13/Task_13 ==================
#++++++++++++++++++++++++Умова/Condition+++++++++++++++++++++++

# Повернімося до завдання з пункту 8 для розрахунку площі. Ширина та висота задані у рядковому вигляді.
# Необхідно, як і раніше, розрахувати площу, але потрібно рядковий тип перетворити на чисельний (float) 
# при розрахунку площі area. Не забудьте також додати до змінної show рядок з наступним шаблоном:
# 'With width <значення ширини> and length <значення довжини> of the room, its area is equal to <значення площі>'.

# +++++++++++++++++Код/Code+++++++++++++++++++++++++++++++++++
# length = 2.75
# width = 1.75
# area =length*width
# length=str(length)
# width=str(width)

# show = f"With width {width}\nand length {length} of the room,\nits area is equal to {area}"
# print(f"{show}")
